Сквозной процесс создания дружбы [#505774] fix
