--- a/docs/process/friendship.md
+++ b/docs/process/friendship.md
@@ -1,38 +1,39 @@
 → Пользователь Б становится подписчиком Пользователя А  
 
 ### Диаграмма последовательности для принятия заявки
-@startuml  
-actor User 
-participant FriendRequestController as Controller  
-participant FriendRequestService as Service  
-participant FriendRequestRepository as Repository
-database DB  
+```mermaid
+sequenceDiagram
+    actor User as User
+    participant Controller as FriendRequestController
+    participant Service as FriendRequestService
+    participant Repository as FriendRequestRepository
+    participant DB as DB
 
-User -> Controller : принять заявку  
-Controller -> Service : accept(requestId, userId)  
-Service -> Repository : findById(requestId)  
-Repository -> DB : SELECT friend_request  
-DB --> Repository : заявка  
-Repository --> Service : FriendRequest  
+    User ->> Controller: принять заявку
+    Controller ->> Service: accept(requestId, userId)
+    Service ->> Repository: findById(requestId)
+    Repository ->> DB: SELECT friend_request
+    DB -->> Repository: заявка
+    Repository -->> Service: FriendRequest
 
-alt заявка существует и находится в PENDING  
-Service -> Repository : save(ACCEPTED)  
-Repository -> DB : UPDATE friend_request  
-DB --> Repository : результат  
-Repository --> Service : сохранённая заявка  
-Service --> Controller : результат операции  
-Controller --> User : заявка принята  
-else переход запрещён  
-Service --> Controller : ошибка процесса  
-Controller --> User : сообщение об ошибке  
-end  
-@enduml  
+    alt заявка существует и находится в PENDING
+        Service ->> Repository: save(ACCEPTED)
+        Repository ->> DB: UPDATE friend_request
+        DB -->> Repository: результат
+        Repository -->> Service: сохранённая заявка
+        Service -->> Controller: результат операции
+        Controller -->> User: заявка принята
+    else переход запрещён
+        Service -->> Controller: ошибка процесса
+        Controller -->> User: сообщение об ошибке
+    end
+```
 
 ### При отклонении заявки
 Если заявка на дружбу будет отклонена Пользователем Б, то статус изменится на REJECTED.
